; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)

  (:predicates
    (on ?x - block ?y - block)
    (ontable ?x - block)
    (clear ?x - block)
    (holding ?x - block)
    (handempty)
  )

  (:action pick-up
    :parameters (?x - block)
    :precondition
      (and
        (clear ?x)
        (ontable ?x)
        (handempty)
      )
    :effect
      (and
        (not (clear ?x))
        (not (ontable ?x))
        (not (handempty))
        (holding ?x)
      )
  )

  (:action put-down
    :parameters (?x - block)
    :precondition
      (holding ?x)
    :effect
      (and
        (not (holding ?x))
        (handempty)
        (ontable ?x)
        (clear ?x)
      )
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition
      (and
        (holding ?x)
        (clear ?y)
      )
    :effect
      (and
        (not (holding ?x))
        (handempty)
        (clear ?x)
        (not (clear ?y))
        (on ?x ?y)
      )
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition
      (and
        (on ?x ?y)
        (clear ?x)
        (handempty)
      )
    :effect
      (and
        (holding ?x)
        (clear ?y)
        (not (clear ?x))
        (not (handempty))
        (not (on ?x ?y))
      )
  )
)

; problem
(define (problem BLOCK-6)
  (:domain BLOCKS)

  (:objects A B C D E F - block)

  (:init
    (handempty)
    (clear A)
    (clear D)
    (clear F)
    (ontable C)
    (ontable D)
    (ontable B)
    (on A E)
    (on E C)
    (on F B)
  )

  (:goal
    (and
      (on B C)
      (on C F)
      (on F A)
      (on D E)
    )
  )
)

; plan
1. (unstack a e)
   deleted: (clear a) (handempty) (on a e)
   added: (holding a) (clear e)
   goals met: 0 of 4
2. (put-down a)
   deleted: (holding a)
   added: (handempty) (ontable a) (clear a)
   goals met: 0 of 4
3. (unstack e c)
   deleted: (clear e) (handempty) (on e c)
   added: (holding e) (clear c)
   goals met: 0 of 4
4. (put-down e)
   deleted: (holding e)
   added: (handempty) (ontable e) (clear e)
   goals met: 0 of 4
5. (pick-up d)
   deleted: (clear d) (ontable d) (handempty)
   added: (holding d)
   goals met: 0 of 4
6. (stack d e)
   deleted: (holding d) (clear e)
   added: (handempty) (clear d) (on d e)
   goals met: 1 of 4
7. (unstack f b)
   deleted: (clear f) (handempty) (on f b)
   added: (holding f) (clear b)
   goals met: 1 of 4
8. (stack f a)
   deleted: (holding f) (clear a)
   added: (handempty) (clear f) (on f a)
   goals met: 2 of 4
9. (pick-up c)
   deleted: (clear c) (ontable c) (handempty)
   added: (holding c)
   goals met: 2 of 4
10. (stack c f)
   deleted: (holding c) (clear f)
   added: (handempty) (clear c) (on c f)
   goals met: 3 of 4
11. (pick-up b)
   deleted: (clear b) (ontable b) (handempty)
   added: (holding b)
   goals met: 3 of 4
12. (stack b c)
   deleted: (holding b) (clear c)
   added: (handempty) (clear b) (on b c)
   goals met: 4 of 4
